# https://github.com/Homebrew/homebrew-bundle
# specify a directory to install
cask_args appdir: '/Applications'
# install packages
tap 'caskroom/homebrew-cask' || true
tap 'caskroom/versions' || true
brew 'git'
brew 'bash-completion'
brew 'tree'
brew 'node'
# need to install java before jenkins
cask 'java'
brew 'wget'
# Casks
cask 'vlc'
cask 'google-chrome'
cask 'dropbox'
cask 'evernote'
cask 'skype'
cask 'virtualbox'
cask 'slack'
cask 'spotify'
cask 'kindle'
cask '1password'
cask 'sizeup'
cask 'iterm2'
cask 'calibre'
cask 'dash'
cask 'atom'
cask 'google-drive'
cask 'firefox'
cask 'skitch'
cask 'vmware-fusion'
cask 'macdown' #markdown viewer
cask 'sublime'
# To convert mov to gif
# https://gist.github.com/dergachev/4627207
cask 'xquartz'
cask 'fluid'
brew 'gifsicle'
brew 'curl'
brew 'tree'
brew 'gawk'
brew 'wget'
brew 'zsh'
brew 'nmap'
brew 'tmux'
brew 'rust'
brew 'libxml2'
brew 'imagemagick'

# A command to download mac store app
# http://www.softantenna.com/wp/mac/mas-cli/
# https://github.com/argon/mas
tap 'argon/mas'
brew 'mas'
# run download_apps later on

#go
brew 'go'

# python
brew 'python'
brew 'python3'


# for my blog, install jekyll and bundler
# https://github.com/sergiokopplin/indigo
